; ModuleID = 'af_xdp_kern.c'
source_filename = "af_xdp_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !859, line: 18, type: !62, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !59, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "af_xdp_kern.c", directory: "/home/ljkim/xdp/xdp_redis/src")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !49, !51}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DISubprogram(name: "is_nvm_addr", scope: !52, file: !52, line: 1678, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !58)
!52 = !DIFile(filename: "./server.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !56}
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!58 = !{}
!59 = !{!0, !60, !70, !75, !137, !139, !850, !853}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "xsks_map", scope: !2, file: !3, line: 20, type: !62, isLocal: false, isDefinition: true)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !63, line: 33, size: 160, elements: !64)
!63 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!64 = !{!65, !66, !67, !68, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !63, line: 34, baseType: !7, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !62, file: !63, line: 35, baseType: !7, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !62, file: !63, line: 36, baseType: !7, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !62, file: !63, line: 37, baseType: !7, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !62, file: !63, line: 38, baseType: !7, size: 32, offset: 128)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 146, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 4)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !77, line: 137, type: !78, isLocal: false, isDefinition: false)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !80, line: 7, baseType: !81)
!80 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !82, line: 49, size: 1728, elements: !83)
!82 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !99, !101, !102, !103, !106, !107, !109, !113, !116, !120, !123, !126, !127, !128, !132, !133}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !81, file: !82, line: 51, baseType: !55, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !81, file: !82, line: 54, baseType: !49, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !81, file: !82, line: 55, baseType: !49, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !81, file: !82, line: 56, baseType: !49, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !81, file: !82, line: 57, baseType: !49, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !81, file: !82, line: 58, baseType: !49, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !81, file: !82, line: 59, baseType: !49, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !81, file: !82, line: 60, baseType: !49, size: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !81, file: !82, line: 61, baseType: !49, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !81, file: !82, line: 64, baseType: !49, size: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !81, file: !82, line: 65, baseType: !49, size: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !81, file: !82, line: 66, baseType: !49, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !81, file: !82, line: 68, baseType: !97, size: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !82, line: 36, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !81, file: !82, line: 70, baseType: !100, size: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !81, file: !82, line: 72, baseType: !55, size: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !81, file: !82, line: 73, baseType: !55, size: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !81, file: !82, line: 74, baseType: !104, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 152, baseType: !45)
!105 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !81, file: !82, line: 77, baseType: !48, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !81, file: !82, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !81, file: !82, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !81, file: !82, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !82, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !81, file: !82, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 153, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !105, line: 47, baseType: !119)
!119 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !81, file: !82, line: 91, baseType: !121, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !82, line: 37, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !81, file: !82, line: 92, baseType: !124, size: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !82, line: 38, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !81, file: !82, line: 93, baseType: !100, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !81, file: !82, line: 94, baseType: !44, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !81, file: !82, line: 95, baseType: !129, size: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 46, baseType: !131)
!130 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!131 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !81, file: !82, line: 96, baseType: !55, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !81, file: !82, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "stdout", scope: !2, file: !77, line: 138, type: !78, isLocal: false, isDefinition: false)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "server", scope: !2, file: !52, line: 1411, type: !141, isLocal: false, isDefinition: false)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisServer", file: !52, line: 922, size: 34112, elements: !142)
!142 = !{!143, !178, !179, !182, !185, !189, !190, !191, !193, !194, !270, !271, !272, !335, !336, !337, !338, !339, !340, !341, !342, !343, !347, !348, !349, !350, !351, !380, !382, !383, !384, !386, !387, !388, !391, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !521, !522, !523, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !669, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !768, !769, !770, !771, !772, !773, !774, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !800, !801, !802, !803, !804, !805, !840, !841, !842, !843, !844, !845, !849}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !141, file: !52, line: 926, baseType: !144, size: 9344)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config", file: !145, line: 8, size: 9344, elements: !146)
!145 = !DIFile(filename: "./../common/common_defines.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!146 = !{!147, !149, !150, !151, !155, !156, !157, !158, !160, !161, !165, !166, !170, !174, !175, !176, !177}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "xdp_flags", scope: !144, file: !145, line: 9, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !144, file: !145, line: 10, baseType: !55, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !144, file: !145, line: 11, baseType: !49, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ifname_buf", scope: !144, file: !145, line: 12, baseType: !152, size: 128, offset: 128)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 16)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_ifindex", scope: !144, file: !145, line: 13, baseType: !55, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_ifname", scope: !144, file: !145, line: 14, baseType: !49, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_ifname_buf", scope: !144, file: !145, line: 15, baseType: !152, size: 128, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "do_unload", scope: !144, file: !145, line: 16, baseType: !159, size: 8, offset: 512)
!159 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_maps", scope: !144, file: !145, line: 17, baseType: !159, size: 8, offset: 520)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pin_dir", scope: !144, file: !145, line: 18, baseType: !162, size: 4096, offset: 528)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 4096, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !144, file: !145, line: 19, baseType: !162, size: 4096, offset: 4624)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "progsec", scope: !144, file: !145, line: 20, baseType: !167, size: 256, offset: 8720)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 256, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "src_mac", scope: !144, file: !145, line: 21, baseType: !171, size: 144, offset: 8976)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 144, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 18)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dest_mac", scope: !144, file: !145, line: 22, baseType: !171, size: 144, offset: 9120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "xsk_bind_flags", scope: !144, file: !145, line: 23, baseType: !46, size: 16, offset: 9264)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "xsk_if_queue", scope: !144, file: !145, line: 24, baseType: !55, size: 32, offset: 9280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "xsk_poll_mode", scope: !144, file: !145, line: 25, baseType: !159, size: 8, offset: 9312)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "packet_buffer", scope: !141, file: !52, line: 927, baseType: !44, size: 64, offset: 9344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "umem", scope: !141, file: !52, line: 928, baseType: !180, size: 64, offset: 9408)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "xsk_umem_info", file: !52, line: 928, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "xsk_socket", scope: !141, file: !52, line: 929, baseType: !183, size: 64, offset: 9472)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "xsk_socket_info", file: !52, line: 929, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !141, file: !52, line: 934, baseType: !186, size: 32, offset: 9536)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !187, line: 97, baseType: !188)
!187 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !105, line: 154, baseType: !55)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "configfile", scope: !141, file: !52, line: 935, baseType: !49, size: 64, offset: 9600)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !141, file: !52, line: 936, baseType: !49, size: 64, offset: 9664)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "exec_argv", scope: !141, file: !52, line: 937, baseType: !192, size: 64, offset: 9728)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "hz", scope: !141, file: !52, line: 938, baseType: !55, size: 32, offset: 9792)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !141, file: !52, line: 939, baseType: !195, size: 64, offset: 9856)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !52, line: 666, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !52, line: 658, size: 448, elements: !198)
!198 = !{!199, !264, !265, !266, !267, !268, !269}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !197, file: !52, line: 659, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !202, line: 82, baseType: !203)
!202 = !DIFile(filename: "./dict.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !202, line: 76, size: 768, elements: !204)
!204 = !{!205, !232, !233, !262, !263}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !202, line: 77, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !202, line: 65, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !202, line: 58, size: 384, elements: !209)
!209 = !{!210, !218, !222, !223, !227, !231}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !208, file: !202, line: 59, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !56}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !215, line: 27, baseType: !216)
!215 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !105, line: 48, baseType: !217)
!217 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !208, file: !202, line: 60, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!44, !44, !56}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !208, file: !202, line: 61, baseType: !219, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !208, file: !202, line: 62, baseType: !224, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!55, !44, !56, !56}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !208, file: !202, line: 63, baseType: !228, size: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !44, !44}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !208, file: !202, line: 64, baseType: !228, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !203, file: !202, line: 78, baseType: !44, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !203, file: !202, line: 79, baseType: !234, size: 512, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 512, elements: !260)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !202, line: 74, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !202, line: 69, size: 256, elements: !237)
!237 = !{!238, !257, !258, !259}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !236, file: !202, line: 70, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !202, line: 56, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !202, line: 47, size: 192, elements: !243)
!243 = !{!244, !245, !255}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !242, file: !202, line: 48, baseType: !44, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !242, file: !202, line: 54, baseType: !246, size: 64, offset: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !202, line: 49, size: 64, elements: !247)
!247 = !{!248, !249, !250, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !246, file: !202, line: 50, baseType: !44, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !246, file: !202, line: 51, baseType: !214, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "s64", scope: !246, file: !202, line: 52, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !252, line: 27, baseType: !118)
!252 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "")
!253 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !246, file: !202, line: 53, baseType: !254, size: 64)
!254 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !202, line: 55, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !236, file: !202, line: 71, baseType: !131, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !236, file: !202, line: 72, baseType: !131, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !236, file: !202, line: 73, baseType: !131, size: 64, offset: 192)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !203, file: !202, line: 80, baseType: !45, size: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !203, file: !202, line: 81, baseType: !131, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !197, file: !52, line: 660, baseType: !200, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "blocking_keys", scope: !197, file: !52, line: 661, baseType: !200, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !197, file: !52, line: 662, baseType: !200, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !197, file: !52, line: 663, baseType: !200, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !197, file: !52, line: 664, baseType: !55, size: 32, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "avg_ttl", scope: !197, file: !52, line: 665, baseType: !119, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !141, file: !52, line: 940, baseType: !200, size: 64, offset: 9920)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "orig_commands", scope: !141, file: !52, line: 941, baseType: !200, size: 64, offset: 9984)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "el", scope: !141, file: !52, line: 942, baseType: !273, size: 64, offset: 10048)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !275, line: 105, baseType: !276)
!275 = !DIFile(filename: "./ae.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !275, line: 93, size: 640, elements: !277)
!277 = !{!278, !279, !280, !281, !285, !299, !306, !327, !328, !329, !334}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !276, file: !275, line: 94, baseType: !55, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "setsize", scope: !276, file: !275, line: 95, baseType: !55, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !276, file: !275, line: 96, baseType: !119, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !276, file: !275, line: 97, baseType: !282, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !283, line: 7, baseType: !284)
!283 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !105, line: 160, baseType: !45)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !276, file: !275, line: 98, baseType: !286, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !275, line: 73, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !275, line: 68, size: 256, elements: !289)
!289 = !{!290, !291, !297, !298}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !288, file: !275, line: 69, baseType: !55, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !288, file: !275, line: 70, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !275, line: 62, baseType: !294)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296, !55, !44, !55}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !288, file: !275, line: 71, baseType: !292, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !288, file: !275, line: 72, baseType: !44, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !276, file: !275, line: 99, baseType: !300, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !275, line: 90, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !275, line: 87, size: 64, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !302, file: !275, line: 88, baseType: !55, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !302, file: !275, line: 89, baseType: !55, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !276, file: !275, line: 100, baseType: !307, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !275, line: 84, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !275, line: 76, size: 448, elements: !310)
!310 = !{!311, !312, !313, !314, !319, !324, !325}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !309, file: !275, line: 77, baseType: !119, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !309, file: !275, line: 78, baseType: !45, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !309, file: !275, line: 79, baseType: !45, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !309, file: !275, line: 80, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !275, line: 63, baseType: !317)
!317 = !DISubroutineType(types: !318)
!318 = !{!55, !296, !119, !44}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !309, file: !275, line: 81, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !275, line: 64, baseType: !322)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !296, !44}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !309, file: !275, line: 82, baseType: !44, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !275, line: 83, baseType: !326, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !276, file: !275, line: 101, baseType: !55, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !276, file: !275, line: 102, baseType: !44, size: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !276, file: !275, line: 103, baseType: !330, size: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !275, line: 65, baseType: !332)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !296}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "aftersleep", scope: !276, file: !275, line: 104, baseType: !330, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "lruclock", scope: !141, file: !52, line: 943, baseType: !7, size: 32, offset: 10112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_asap", scope: !141, file: !52, line: 944, baseType: !55, size: 32, offset: 10144)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "activerehashing", scope: !141, file: !52, line: 945, baseType: !55, size: 32, offset: 10176)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_running", scope: !141, file: !52, line: 946, baseType: !55, size: 32, offset: 10208)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "requirepass", scope: !141, file: !52, line: 947, baseType: !49, size: 64, offset: 10240)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pidfile", scope: !141, file: !52, line: 948, baseType: !49, size: 64, offset: 10304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "arch_bits", scope: !141, file: !52, line: 949, baseType: !55, size: 32, offset: 10368)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cronloops", scope: !141, file: !52, line: 950, baseType: !55, size: 32, offset: 10400)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "runid", scope: !141, file: !52, line: 951, baseType: !344, size: 328, offset: 10432)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 328, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 41)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel_mode", scope: !141, file: !52, line: 952, baseType: !55, size: 32, offset: 10784)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "initial_memory_usage", scope: !141, file: !52, line: 953, baseType: !129, size: 64, offset: 10816)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "always_show_logo", scope: !141, file: !52, line: 954, baseType: !55, size: 32, offset: 10880)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "moduleapi", scope: !141, file: !52, line: 956, baseType: !200, size: 64, offset: 10944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "loadmodule_queue", scope: !141, file: !52, line: 957, baseType: !352, size: 64, offset: 11008)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !354, line: 54, baseType: !355)
!354 = !DIFile(filename: "./adlist.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !354, line: 47, size: 384, elements: !356)
!356 = !{!357, !366, !367, !371, !375, !379}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !355, file: !354, line: 48, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !354, line: 40, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !354, line: 36, size: 192, elements: !361)
!361 = !{!362, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !360, file: !354, line: 37, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !360, file: !354, line: 38, baseType: !363, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !360, file: !354, line: 39, baseType: !44, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !355, file: !354, line: 49, baseType: !358, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !355, file: !354, line: 50, baseType: !368, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!44, !44}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !355, file: !354, line: 51, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !44}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !355, file: !354, line: 52, baseType: !376, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!55, !44, !44}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !355, file: !354, line: 53, baseType: !131, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_pipe", scope: !141, file: !52, line: 958, baseType: !381, size: 64, offset: 11072)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !260)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !141, file: !52, line: 962, baseType: !55, size: 32, offset: 11136)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_backlog", scope: !141, file: !52, line: 963, baseType: !55, size: 32, offset: 11168)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bindaddr", scope: !141, file: !52, line: 964, baseType: !385, size: 1024, offset: 11200)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 1024, elements: !153)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bindaddr_count", scope: !141, file: !52, line: 965, baseType: !55, size: 32, offset: 12224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "unixsocket", scope: !141, file: !52, line: 966, baseType: !49, size: 64, offset: 12288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "unixsocketperm", scope: !141, file: !52, line: 967, baseType: !389, size: 32, offset: 12352)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !187, line: 69, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !105, line: 150, baseType: !7)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ipfd", scope: !141, file: !52, line: 968, baseType: !392, size: 512, offset: 12384)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 512, elements: !153)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ipfd_count", scope: !141, file: !52, line: 969, baseType: !55, size: 32, offset: 12896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sofd", scope: !141, file: !52, line: 970, baseType: !55, size: 32, offset: 12928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cfd", scope: !141, file: !52, line: 971, baseType: !392, size: 512, offset: 12960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cfd_count", scope: !141, file: !52, line: 972, baseType: !55, size: 32, offset: 13472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !141, file: !52, line: 973, baseType: !352, size: 64, offset: 13504)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "clients_to_close", scope: !141, file: !52, line: 974, baseType: !352, size: 64, offset: 13568)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "clients_pending_write", scope: !141, file: !52, line: 975, baseType: !352, size: 64, offset: 13632)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "slaves", scope: !141, file: !52, line: 976, baseType: !352, size: 64, offset: 13696)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !141, file: !52, line: 976, baseType: !352, size: 64, offset: 13760)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "current_client", scope: !141, file: !52, line: 977, baseType: !403, size: 64, offset: 13824)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !52, line: 777, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client", file: !52, line: 723, size: 134848, elements: !406)
!406 = !{!407, !408, !409, !410, !421, !424, !425, !426, !427, !429, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !483, !484, !499, !500, !511, !512, !513, !514, !515, !516, !517}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !405, file: !52, line: 724, baseType: !214, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !405, file: !52, line: 725, baseType: !55, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !405, file: !52, line: 726, baseType: !195, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !52, line: 727, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !52, line: 640, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !52, line: 625, size: 192, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !52, line: 626, baseType: !7, size: 4, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !413, file: !52, line: 627, baseType: !7, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !413, file: !52, line: 628, baseType: !7, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !413, file: !52, line: 631, baseType: !55, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "need_mv_to_nvm", scope: !413, file: !52, line: 633, baseType: !7, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !413, file: !52, line: 638, baseType: !44, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !405, file: !52, line: 728, baseType: !422, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !423, line: 42, baseType: !49)
!423 = !DIFile(filename: "./sds.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pending_querybuf", scope: !405, file: !52, line: 729, baseType: !422, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf_peak", scope: !405, file: !52, line: 732, baseType: !129, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !405, file: !52, line: 733, baseType: !55, size: 32, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !405, file: !52, line: 734, baseType: !428, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !405, file: !52, line: 735, baseType: !430, size: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !52, line: 1334, size: 640, elements: !432)
!432 = !{!433, !434, !439, !440, !441, !442, !448, !449, !450, !451, !452}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !52, line: 1335, baseType: !49, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !431, file: !52, line: 1336, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !52, line: 1332, baseType: !437)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !403}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !431, file: !52, line: 1337, baseType: !55, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sflags", scope: !431, file: !52, line: 1338, baseType: !49, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !52, line: 1339, baseType: !55, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "getkeys_proc", scope: !431, file: !52, line: 1342, baseType: !443, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisGetKeysProc", file: !52, line: 1333, baseType: !445)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !430, !428, !55, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "firstkey", scope: !431, file: !52, line: 1344, baseType: !55, size: 32, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lastkey", scope: !431, file: !52, line: 1345, baseType: !55, size: 32, offset: 416)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "keystep", scope: !431, file: !52, line: 1346, baseType: !55, size: 32, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !431, file: !52, line: 1347, baseType: !119, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !431, file: !52, line: 1347, baseType: !119, size: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lastcmd", scope: !405, file: !52, line: 735, baseType: !430, size: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reqtype", scope: !405, file: !52, line: 736, baseType: !55, size: 32, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "multibulklen", scope: !405, file: !52, line: 737, baseType: !55, size: 32, offset: 736)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !405, file: !52, line: 738, baseType: !45, size: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !405, file: !52, line: 739, baseType: !352, size: 64, offset: 832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reply_bytes", scope: !405, file: !52, line: 740, baseType: !217, size: 64, offset: 896)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !405, file: !52, line: 741, baseType: !129, size: 64, offset: 960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !405, file: !52, line: 743, baseType: !282, size: 64, offset: 1024)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !405, file: !52, line: 744, baseType: !282, size: 64, offset: 1088)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "obuf_soft_limit_reached_time", scope: !405, file: !52, line: 745, baseType: !282, size: 64, offset: 1152)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !405, file: !52, line: 746, baseType: !55, size: 32, offset: 1216)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !405, file: !52, line: 747, baseType: !55, size: 32, offset: 1248)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !405, file: !52, line: 748, baseType: !55, size: 32, offset: 1280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "repl_put_online_on_ack", scope: !405, file: !52, line: 749, baseType: !55, size: 32, offset: 1312)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !405, file: !52, line: 750, baseType: !55, size: 32, offset: 1344)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !405, file: !52, line: 751, baseType: !469, size: 64, offset: 1408)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !187, line: 87, baseType: !117)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !405, file: !52, line: 752, baseType: !469, size: 64, offset: 1472)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "replpreamble", scope: !405, file: !52, line: 753, baseType: !422, size: 64, offset: 1536)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "read_reploff", scope: !405, file: !52, line: 754, baseType: !119, size: 64, offset: 1600)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reploff", scope: !405, file: !52, line: 755, baseType: !119, size: 64, offset: 1664)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_off", scope: !405, file: !52, line: 756, baseType: !119, size: 64, offset: 1728)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ack_time", scope: !405, file: !52, line: 757, baseType: !119, size: 64, offset: 1792)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "psync_initial_offset", scope: !405, file: !52, line: 758, baseType: !119, size: 64, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !405, file: !52, line: 761, baseType: !344, size: 328, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "slave_listening_port", scope: !405, file: !52, line: 762, baseType: !55, size: 32, offset: 2272)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ip", scope: !405, file: !52, line: 763, baseType: !480, size: 368, offset: 2304)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 368, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 46)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "slave_capa", scope: !405, file: !52, line: 764, baseType: !55, size: 32, offset: 2688)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !405, file: !52, line: 765, baseType: !485, size: 192, offset: 2752)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !52, line: 680, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !52, line: 675, size: 192, elements: !487)
!487 = !{!488, !496, !497, !498}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !486, file: !52, line: 676, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !52, line: 673, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !52, line: 669, size: 192, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !491, file: !52, line: 670, baseType: !428, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !491, file: !52, line: 671, baseType: !55, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !491, file: !52, line: 672, baseType: !430, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !486, file: !52, line: 677, baseType: !55, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas", scope: !486, file: !52, line: 678, baseType: !55, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "minreplicas_timeout", scope: !486, file: !52, line: 679, baseType: !282, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !405, file: !52, line: 766, baseType: !55, size: 32, offset: 2944)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bpop", scope: !405, file: !52, line: 767, baseType: !501, size: 384, offset: 3008)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "blockingState", file: !52, line: 703, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blockingState", file: !52, line: 684, size: 384, elements: !503)
!503 = !{!504, !506, !507, !508, !509, !510}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !502, file: !52, line: 686, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "mstime_t", file: !52, line: 54, baseType: !119)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !502, file: !52, line: 690, baseType: !200, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !502, file: !52, line: 692, baseType: !411, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "numreplicas", scope: !502, file: !52, line: 696, baseType: !55, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reploffset", scope: !502, file: !52, line: 697, baseType: !119, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "module_blocked_handle", scope: !502, file: !52, line: 700, baseType: !44, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "woff", scope: !405, file: !52, line: 768, baseType: !119, size: 64, offset: 3392)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "watched_keys", scope: !405, file: !52, line: 769, baseType: !352, size: 64, offset: 3456)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !405, file: !52, line: 770, baseType: !200, size: 64, offset: 3520)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !405, file: !52, line: 771, baseType: !352, size: 64, offset: 3584)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "peerid", scope: !405, file: !52, line: 772, baseType: !422, size: 64, offset: 3648)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !405, file: !52, line: 775, baseType: !55, size: 32, offset: 3712)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !405, file: !52, line: 776, baseType: !518, size: 131072, offset: 3744)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 131072, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 16384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "clients_paused", scope: !141, file: !52, line: 978, baseType: !55, size: 32, offset: 13888)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "clients_pause_end_time", scope: !141, file: !52, line: 979, baseType: !505, size: 64, offset: 13952)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "neterr", scope: !141, file: !52, line: 980, baseType: !524, size: 2048, offset: 14016)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_cached_sockets", scope: !141, file: !52, line: 981, baseType: !200, size: 64, offset: 16064)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next_client_id", scope: !141, file: !52, line: 982, baseType: !214, size: 64, offset: 16128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "protected_mode", scope: !141, file: !52, line: 983, baseType: !55, size: 32, offset: 16192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !141, file: !52, line: 985, baseType: !55, size: 32, offset: 16224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "loading_total_bytes", scope: !141, file: !52, line: 986, baseType: !469, size: 64, offset: 16256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "loading_loaded_bytes", scope: !141, file: !52, line: 987, baseType: !469, size: 64, offset: 16320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "loading_start_time", scope: !141, file: !52, line: 988, baseType: !282, size: 64, offset: 16384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "loading_process_events_interval_bytes", scope: !141, file: !52, line: 989, baseType: !469, size: 64, offset: 16448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "delCommand", scope: !141, file: !52, line: 991, baseType: !430, size: 64, offset: 16512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "multiCommand", scope: !141, file: !52, line: 991, baseType: !430, size: 64, offset: 16576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lpushCommand", scope: !141, file: !52, line: 991, baseType: !430, size: 64, offset: 16640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lpopCommand", scope: !141, file: !52, line: 991, baseType: !430, size: 64, offset: 16704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rpopCommand", scope: !141, file: !52, line: 992, baseType: !430, size: 64, offset: 16768)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sremCommand", scope: !141, file: !52, line: 992, baseType: !430, size: 64, offset: 16832)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "execCommand", scope: !141, file: !52, line: 992, baseType: !430, size: 64, offset: 16896)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "expireCommand", scope: !141, file: !52, line: 992, baseType: !430, size: 64, offset: 16960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pexpireCommand", scope: !141, file: !52, line: 993, baseType: !430, size: 64, offset: 17024)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stat_starttime", scope: !141, file: !52, line: 995, baseType: !282, size: 64, offset: 17088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "stat_numcommands", scope: !141, file: !52, line: 996, baseType: !119, size: 64, offset: 17152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stat_numconnections", scope: !141, file: !52, line: 997, baseType: !119, size: 64, offset: 17216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "stat_expiredkeys", scope: !141, file: !52, line: 998, baseType: !119, size: 64, offset: 17280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "stat_evictedkeys", scope: !141, file: !52, line: 999, baseType: !119, size: 64, offset: 17344)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stat_keyspace_hits", scope: !141, file: !52, line: 1000, baseType: !119, size: 64, offset: 17408)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stat_keyspace_misses", scope: !141, file: !52, line: 1001, baseType: !119, size: 64, offset: 17472)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_hits", scope: !141, file: !52, line: 1002, baseType: !119, size: 64, offset: 17536)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_misses", scope: !141, file: !52, line: 1003, baseType: !119, size: 64, offset: 17600)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_key_hits", scope: !141, file: !52, line: 1004, baseType: !119, size: 64, offset: 17664)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "stat_active_defrag_key_misses", scope: !141, file: !52, line: 1005, baseType: !119, size: 64, offset: 17728)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "stat_peak_memory", scope: !141, file: !52, line: 1006, baseType: !129, size: 64, offset: 17792)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "stat_peak_nvm", scope: !141, file: !52, line: 1008, baseType: !129, size: 64, offset: 17856)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "stat_fork_time", scope: !141, file: !52, line: 1010, baseType: !119, size: 64, offset: 17920)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "stat_fork_rate", scope: !141, file: !52, line: 1011, baseType: !254, size: 64, offset: 17984)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "stat_rejected_conn", scope: !141, file: !52, line: 1012, baseType: !119, size: 64, offset: 18048)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sync_full", scope: !141, file: !52, line: 1013, baseType: !119, size: 64, offset: 18112)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sync_partial_ok", scope: !141, file: !52, line: 1014, baseType: !119, size: 64, offset: 18176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sync_partial_err", scope: !141, file: !52, line: 1015, baseType: !119, size: 64, offset: 18240)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog", scope: !141, file: !52, line: 1016, baseType: !352, size: 64, offset: 18304)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog_entry_id", scope: !141, file: !52, line: 1017, baseType: !119, size: 64, offset: 18368)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog_log_slower_than", scope: !141, file: !52, line: 1018, baseType: !119, size: 64, offset: 18432)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "slowlog_max_len", scope: !141, file: !52, line: 1019, baseType: !131, size: 64, offset: 18496)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "resident_set_size", scope: !141, file: !52, line: 1020, baseType: !129, size: 64, offset: 18560)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stat_net_input_bytes", scope: !141, file: !52, line: 1021, baseType: !119, size: 64, offset: 18624)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "stat_net_output_bytes", scope: !141, file: !52, line: 1022, baseType: !119, size: 64, offset: 18688)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "stat_rdb_cow_bytes", scope: !141, file: !52, line: 1023, baseType: !129, size: 64, offset: 18752)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "stat_aof_cow_bytes", scope: !141, file: !52, line: 1024, baseType: !129, size: 64, offset: 18816)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "inst_metric", scope: !141, file: !52, line: 1032, baseType: !573, size: 3648, offset: 18880)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 3648, elements: !581)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !52, line: 1027, size: 1216, elements: !575)
!575 = !{!576, !577, !578, !580}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "last_sample_time", scope: !574, file: !52, line: 1028, baseType: !119, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "last_sample_count", scope: !574, file: !52, line: 1029, baseType: !119, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !574, file: !52, line: 1030, baseType: !579, size: 1024, offset: 128)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 1024, elements: !153)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !574, file: !52, line: 1031, baseType: !55, size: 32, offset: 1152)
!581 = !{!582}
!582 = !DISubrange(count: 3)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !141, file: !52, line: 1034, baseType: !55, size: 32, offset: 22528)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "maxidletime", scope: !141, file: !52, line: 1035, baseType: !55, size: 32, offset: 22560)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tcpkeepalive", scope: !141, file: !52, line: 1036, baseType: !55, size: 32, offset: 22592)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "active_expire_enabled", scope: !141, file: !52, line: 1037, baseType: !55, size: 32, offset: 22624)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_enabled", scope: !141, file: !52, line: 1038, baseType: !55, size: 32, offset: 22656)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_ignore_bytes", scope: !141, file: !52, line: 1039, baseType: !129, size: 64, offset: 22720)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_threshold_lower", scope: !141, file: !52, line: 1040, baseType: !55, size: 32, offset: 22784)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_threshold_upper", scope: !141, file: !52, line: 1041, baseType: !55, size: 32, offset: 22816)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_cycle_min", scope: !141, file: !52, line: 1042, baseType: !55, size: 32, offset: 22848)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "active_defrag_cycle_max", scope: !141, file: !52, line: 1043, baseType: !55, size: 32, offset: 22880)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "client_max_querybuf_len", scope: !141, file: !52, line: 1044, baseType: !129, size: 64, offset: 22912)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dbnum", scope: !141, file: !52, line: 1045, baseType: !55, size: 32, offset: 22976)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "supervised", scope: !141, file: !52, line: 1046, baseType: !55, size: 32, offset: 23008)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "supervised_mode", scope: !141, file: !52, line: 1047, baseType: !55, size: 32, offset: 23040)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "daemonize", scope: !141, file: !52, line: 1048, baseType: !55, size: 32, offset: 23072)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "client_obuf_limits", scope: !141, file: !52, line: 1049, baseType: !599, size: 576, offset: 23104)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 576, elements: !581)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "clientBufferLimitsConfig", file: !52, line: 832, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clientBufferLimitsConfig", file: !52, line: 828, size: 192, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hard_limit_bytes", scope: !601, file: !52, line: 829, baseType: !217, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "soft_limit_bytes", scope: !601, file: !52, line: 830, baseType: !217, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "soft_limit_seconds", scope: !601, file: !52, line: 831, baseType: !282, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "aof_state", scope: !141, file: !52, line: 1051, baseType: !55, size: 32, offset: 23680)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fsync", scope: !141, file: !52, line: 1052, baseType: !55, size: 32, offset: 23712)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "aof_filename", scope: !141, file: !52, line: 1053, baseType: !49, size: 64, offset: 23744)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "aof_no_fsync_on_rewrite", scope: !141, file: !52, line: 1054, baseType: !55, size: 32, offset: 23808)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_perc", scope: !141, file: !52, line: 1055, baseType: !55, size: 32, offset: 23840)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_min_size", scope: !141, file: !52, line: 1056, baseType: !469, size: 64, offset: 23872)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_base_size", scope: !141, file: !52, line: 1057, baseType: !469, size: 64, offset: 23936)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "aof_current_size", scope: !141, file: !52, line: 1058, baseType: !469, size: 64, offset: 24000)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_scheduled", scope: !141, file: !52, line: 1059, baseType: !55, size: 32, offset: 24064)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "aof_child_pid", scope: !141, file: !52, line: 1060, baseType: !186, size: 32, offset: 24096)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_buf_blocks", scope: !141, file: !52, line: 1061, baseType: !352, size: 64, offset: 24128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aof_buf", scope: !141, file: !52, line: 1062, baseType: !422, size: 64, offset: 24192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aof_fd", scope: !141, file: !52, line: 1063, baseType: !55, size: 32, offset: 24256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aof_selected_db", scope: !141, file: !52, line: 1064, baseType: !55, size: 32, offset: 24288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "aof_flush_postponed_start", scope: !141, file: !52, line: 1065, baseType: !282, size: 64, offset: 24320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "aof_last_fsync", scope: !141, file: !52, line: 1066, baseType: !282, size: 64, offset: 24384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_time_last", scope: !141, file: !52, line: 1067, baseType: !282, size: 64, offset: 24448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_time_start", scope: !141, file: !52, line: 1068, baseType: !282, size: 64, offset: 24512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "aof_lastbgrewrite_status", scope: !141, file: !52, line: 1069, baseType: !55, size: 32, offset: 24576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "aof_delayed_fsync", scope: !141, file: !52, line: 1070, baseType: !131, size: 64, offset: 24640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "aof_rewrite_incremental_fsync", scope: !141, file: !52, line: 1071, baseType: !55, size: 32, offset: 24704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "aof_last_write_status", scope: !141, file: !52, line: 1072, baseType: !55, size: 32, offset: 24736)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aof_last_write_errno", scope: !141, file: !52, line: 1073, baseType: !55, size: 32, offset: 24768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "aof_load_truncated", scope: !141, file: !52, line: 1074, baseType: !55, size: 32, offset: 24800)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aof_use_rdb_preamble", scope: !141, file: !52, line: 1075, baseType: !55, size: 32, offset: 24832)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_write_data_to_child", scope: !141, file: !52, line: 1077, baseType: !55, size: 32, offset: 24864)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_read_data_from_parent", scope: !141, file: !52, line: 1078, baseType: !55, size: 32, offset: 24896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_write_ack_to_parent", scope: !141, file: !52, line: 1079, baseType: !55, size: 32, offset: 24928)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_read_ack_from_child", scope: !141, file: !52, line: 1080, baseType: !55, size: 32, offset: 24960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_write_ack_to_child", scope: !141, file: !52, line: 1081, baseType: !55, size: 32, offset: 24992)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "aof_pipe_read_ack_from_parent", scope: !141, file: !52, line: 1082, baseType: !55, size: 32, offset: 25024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "aof_stop_sending_diff", scope: !141, file: !52, line: 1083, baseType: !55, size: 32, offset: 25056)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "aof_child_diff", scope: !141, file: !52, line: 1085, baseType: !422, size: 64, offset: 25088)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !141, file: !52, line: 1087, baseType: !119, size: 64, offset: 25152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_before_bgsave", scope: !141, file: !52, line: 1088, baseType: !119, size: 64, offset: 25216)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_child_pid", scope: !141, file: !52, line: 1089, baseType: !186, size: 32, offset: 25280)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "saveparams", scope: !141, file: !52, line: 1090, baseType: !643, size: 64, offset: 25344)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "saveparam", file: !52, line: 779, size: 128, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !644, file: !52, line: 780, baseType: !282, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "changes", scope: !644, file: !52, line: 781, baseType: !55, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "saveparamslen", scope: !141, file: !52, line: 1091, baseType: !55, size: 32, offset: 25408)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_filename", scope: !141, file: !52, line: 1092, baseType: !49, size: 64, offset: 25472)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_compression", scope: !141, file: !52, line: 1093, baseType: !55, size: 32, offset: 25536)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_checksum", scope: !141, file: !52, line: 1094, baseType: !55, size: 32, offset: 25568)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lastsave", scope: !141, file: !52, line: 1095, baseType: !282, size: 64, offset: 25600)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lastbgsave_try", scope: !141, file: !52, line: 1096, baseType: !282, size: 64, offset: 25664)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_save_time_last", scope: !141, file: !52, line: 1097, baseType: !282, size: 64, offset: 25728)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_save_time_start", scope: !141, file: !52, line: 1098, baseType: !282, size: 64, offset: 25792)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_bgsave_scheduled", scope: !141, file: !52, line: 1099, baseType: !55, size: 32, offset: 25856)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_child_type", scope: !141, file: !52, line: 1100, baseType: !55, size: 32, offset: 25888)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lastbgsave_status", scope: !141, file: !52, line: 1101, baseType: !55, size: 32, offset: 25920)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "stop_writes_on_bgsave_err", scope: !141, file: !52, line: 1102, baseType: !55, size: 32, offset: 25952)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_pipe_write_result_to_parent", scope: !141, file: !52, line: 1103, baseType: !55, size: 32, offset: 25984)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rdb_pipe_read_result_from_child", scope: !141, file: !52, line: 1104, baseType: !55, size: 32, offset: 26016)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "child_info_pipe", scope: !141, file: !52, line: 1106, baseType: !381, size: 64, offset: 26048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "child_info_data", scope: !141, file: !52, line: 1111, baseType: !664, size: 192, offset: 26112)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !52, line: 1107, size: 192, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "process_type", scope: !664, file: !52, line: 1108, baseType: !55, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cow_size", scope: !664, file: !52, line: 1109, baseType: !129, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !664, file: !52, line: 1110, baseType: !217, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "also_propagate", scope: !141, file: !52, line: 1113, baseType: !670, size: 128, offset: 26304)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisOpArray", file: !52, line: 858, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisOpArray", file: !52, line: 855, size: 128, elements: !672)
!672 = !{!673, !683}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !671, file: !52, line: 856, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisOp", file: !52, line: 846, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisOp", file: !52, line: 842, size: 256, elements: !677)
!677 = !{!678, !679, !680, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !676, file: !52, line: 843, baseType: !428, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !676, file: !52, line: 844, baseType: !55, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dbid", scope: !676, file: !52, line: 844, baseType: !55, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !676, file: !52, line: 844, baseType: !55, size: 32, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !676, file: !52, line: 845, baseType: !430, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "numops", scope: !671, file: !52, line: 857, baseType: !55, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "logfile", scope: !141, file: !52, line: 1115, baseType: !49, size: 64, offset: 26432)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "syslog_enabled", scope: !141, file: !52, line: 1116, baseType: !55, size: 32, offset: 26496)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "syslog_ident", scope: !141, file: !52, line: 1117, baseType: !49, size: 64, offset: 26560)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "syslog_facility", scope: !141, file: !52, line: 1118, baseType: !55, size: 32, offset: 26624)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "replid", scope: !141, file: !52, line: 1120, baseType: !344, size: 328, offset: 26656)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "replid2", scope: !141, file: !52, line: 1121, baseType: !344, size: 328, offset: 26984)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "master_repl_offset", scope: !141, file: !52, line: 1122, baseType: !119, size: 64, offset: 27328)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "second_replid_offset", scope: !141, file: !52, line: 1123, baseType: !119, size: 64, offset: 27392)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "slaveseldb", scope: !141, file: !52, line: 1124, baseType: !55, size: 32, offset: 27456)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "repl_ping_slave_period", scope: !141, file: !52, line: 1125, baseType: !55, size: 32, offset: 27488)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "repl_backlog", scope: !141, file: !52, line: 1126, baseType: !49, size: 64, offset: 27520)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "repl_backlog_size", scope: !141, file: !52, line: 1127, baseType: !119, size: 64, offset: 27584)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "repl_backlog_histlen", scope: !141, file: !52, line: 1128, baseType: !119, size: 64, offset: 27648)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "repl_backlog_idx", scope: !141, file: !52, line: 1129, baseType: !119, size: 64, offset: 27712)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "repl_backlog_off", scope: !141, file: !52, line: 1131, baseType: !119, size: 64, offset: 27776)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "repl_backlog_time_limit", scope: !141, file: !52, line: 1133, baseType: !282, size: 64, offset: 27840)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "repl_no_slaves_since", scope: !141, file: !52, line: 1135, baseType: !282, size: 64, offset: 27904)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "repl_min_slaves_to_write", scope: !141, file: !52, line: 1137, baseType: !55, size: 32, offset: 27968)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "repl_min_slaves_max_lag", scope: !141, file: !52, line: 1138, baseType: !55, size: 32, offset: 28000)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "repl_good_slaves_count", scope: !141, file: !52, line: 1139, baseType: !55, size: 32, offset: 28032)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "repl_diskless_sync", scope: !141, file: !52, line: 1140, baseType: !55, size: 32, offset: 28064)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "repl_diskless_sync_delay", scope: !141, file: !52, line: 1141, baseType: !55, size: 32, offset: 28096)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "masterauth", scope: !141, file: !52, line: 1143, baseType: !49, size: 64, offset: 28160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "masterhost", scope: !141, file: !52, line: 1144, baseType: !49, size: 64, offset: 28224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "masterport", scope: !141, file: !52, line: 1145, baseType: !55, size: 32, offset: 28288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "repl_timeout", scope: !141, file: !52, line: 1146, baseType: !55, size: 32, offset: 28320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !141, file: !52, line: 1147, baseType: !403, size: 64, offset: 28352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cached_master", scope: !141, file: !52, line: 1148, baseType: !403, size: 64, offset: 28416)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "repl_syncio_timeout", scope: !141, file: !52, line: 1149, baseType: !55, size: 32, offset: 28480)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "repl_state", scope: !141, file: !52, line: 1150, baseType: !55, size: 32, offset: 28512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "repl_transfer_size", scope: !141, file: !52, line: 1151, baseType: !469, size: 64, offset: 28544)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "repl_transfer_read", scope: !141, file: !52, line: 1152, baseType: !469, size: 64, offset: 28608)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "repl_transfer_last_fsync_off", scope: !141, file: !52, line: 1153, baseType: !469, size: 64, offset: 28672)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "repl_transfer_s", scope: !141, file: !52, line: 1154, baseType: !55, size: 32, offset: 28736)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "repl_transfer_fd", scope: !141, file: !52, line: 1155, baseType: !55, size: 32, offset: 28768)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "repl_transfer_tmpfile", scope: !141, file: !52, line: 1156, baseType: !49, size: 64, offset: 28800)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "repl_transfer_lastio", scope: !141, file: !52, line: 1157, baseType: !282, size: 64, offset: 28864)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "repl_serve_stale_data", scope: !141, file: !52, line: 1158, baseType: !55, size: 32, offset: 28928)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "repl_slave_ro", scope: !141, file: !52, line: 1159, baseType: !55, size: 32, offset: 28960)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "repl_down_since", scope: !141, file: !52, line: 1160, baseType: !282, size: 64, offset: 28992)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "repl_disable_tcp_nodelay", scope: !141, file: !52, line: 1161, baseType: !55, size: 32, offset: 29056)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "slave_priority", scope: !141, file: !52, line: 1162, baseType: !55, size: 32, offset: 29088)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "slave_announce_port", scope: !141, file: !52, line: 1163, baseType: !55, size: 32, offset: 29120)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "slave_announce_ip", scope: !141, file: !52, line: 1164, baseType: !49, size: 64, offset: 29184)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "master_replid", scope: !141, file: !52, line: 1168, baseType: !344, size: 328, offset: 29248)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "master_initial_offset", scope: !141, file: !52, line: 1169, baseType: !119, size: 64, offset: 29632)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "repl_slave_lazy_flush", scope: !141, file: !52, line: 1170, baseType: !55, size: 32, offset: 29696)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "repl_scriptcache_dict", scope: !141, file: !52, line: 1172, baseType: !200, size: 64, offset: 29760)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "repl_scriptcache_fifo", scope: !141, file: !52, line: 1173, baseType: !352, size: 64, offset: 29824)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "repl_scriptcache_size", scope: !141, file: !52, line: 1174, baseType: !7, size: 32, offset: 29888)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "clients_waiting_acks", scope: !141, file: !52, line: 1176, baseType: !352, size: 64, offset: 29952)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "get_ack_from_slaves", scope: !141, file: !52, line: 1177, baseType: !55, size: 32, offset: 30016)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "maxclients", scope: !141, file: !52, line: 1179, baseType: !7, size: 32, offset: 30048)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "maxmemory", scope: !141, file: !52, line: 1180, baseType: !217, size: 64, offset: 30080)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "maxmemory_policy", scope: !141, file: !52, line: 1181, baseType: !55, size: 32, offset: 30144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "maxmemory_samples", scope: !141, file: !52, line: 1182, baseType: !55, size: 32, offset: 30176)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lfu_log_factor", scope: !141, file: !52, line: 1183, baseType: !7, size: 32, offset: 30208)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lfu_decay_time", scope: !141, file: !52, line: 1184, baseType: !7, size: 32, offset: 30240)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bpop_blocked_clients", scope: !141, file: !52, line: 1186, baseType: !7, size: 32, offset: 30272)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "unblocked_clients", scope: !141, file: !52, line: 1187, baseType: !352, size: 64, offset: 30336)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ready_keys", scope: !141, file: !52, line: 1188, baseType: !352, size: 64, offset: 30400)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sort_desc", scope: !141, file: !52, line: 1191, baseType: !55, size: 32, offset: 30464)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sort_alpha", scope: !141, file: !52, line: 1192, baseType: !55, size: 32, offset: 30496)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sort_bypattern", scope: !141, file: !52, line: 1193, baseType: !55, size: 32, offset: 30528)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sort_store", scope: !141, file: !52, line: 1194, baseType: !55, size: 32, offset: 30560)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "hash_max_ziplist_entries", scope: !141, file: !52, line: 1196, baseType: !129, size: 64, offset: 30592)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "hash_max_ziplist_value", scope: !141, file: !52, line: 1197, baseType: !129, size: 64, offset: 30656)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "set_max_intset_entries", scope: !141, file: !52, line: 1198, baseType: !129, size: 64, offset: 30720)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "zset_max_ziplist_entries", scope: !141, file: !52, line: 1199, baseType: !129, size: 64, offset: 30784)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "zset_max_ziplist_value", scope: !141, file: !52, line: 1200, baseType: !129, size: 64, offset: 30848)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "hll_sparse_max_bytes", scope: !141, file: !52, line: 1201, baseType: !129, size: 64, offset: 30912)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "list_max_ziplist_size", scope: !141, file: !52, line: 1203, baseType: !55, size: 32, offset: 30976)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "list_compress_depth", scope: !141, file: !52, line: 1204, baseType: !55, size: 32, offset: 31008)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "unixtime", scope: !141, file: !52, line: 1206, baseType: !282, size: 64, offset: 31040)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mstime", scope: !141, file: !52, line: 1207, baseType: !119, size: 64, offset: 31104)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !141, file: !52, line: 1209, baseType: !200, size: 64, offset: 31168)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !141, file: !52, line: 1210, baseType: !352, size: 64, offset: 31232)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "notify_keyspace_events", scope: !141, file: !52, line: 1211, baseType: !55, size: 32, offset: 31296)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_enabled", scope: !141, file: !52, line: 1214, baseType: !55, size: 32, offset: 31328)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_node_timeout", scope: !141, file: !52, line: 1215, baseType: !505, size: 64, offset: 31360)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_configfile", scope: !141, file: !52, line: 1216, baseType: !49, size: 64, offset: 31424)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cluster", scope: !141, file: !52, line: 1217, baseType: !766, size: 64, offset: 31488)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "clusterState", file: !52, line: 909, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_migration_barrier", scope: !141, file: !52, line: 1218, baseType: !55, size: 32, offset: 31552)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_slave_validity_factor", scope: !141, file: !52, line: 1219, baseType: !55, size: 32, offset: 31584)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_require_full_coverage", scope: !141, file: !52, line: 1220, baseType: !55, size: 32, offset: 31616)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_announce_ip", scope: !141, file: !52, line: 1222, baseType: !49, size: 64, offset: 31680)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_announce_port", scope: !141, file: !52, line: 1223, baseType: !55, size: 32, offset: 31744)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_announce_bus_port", scope: !141, file: !52, line: 1224, baseType: !55, size: 32, offset: 31776)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lua", scope: !141, file: !52, line: 1226, baseType: !775, size: 64, offset: 31808)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !777, line: 50, baseType: !778)
!777 = !DIFile(filename: "../deps/lua/src/lua.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !777, line: 50, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lua_client", scope: !141, file: !52, line: 1227, baseType: !403, size: 64, offset: 31872)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lua_caller", scope: !141, file: !52, line: 1228, baseType: !403, size: 64, offset: 31936)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lua_scripts", scope: !141, file: !52, line: 1229, baseType: !200, size: 64, offset: 32000)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lua_time_limit", scope: !141, file: !52, line: 1230, baseType: !505, size: 64, offset: 32064)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lua_time_start", scope: !141, file: !52, line: 1231, baseType: !505, size: 64, offset: 32128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lua_write_dirty", scope: !141, file: !52, line: 1232, baseType: !55, size: 32, offset: 32192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lua_random_dirty", scope: !141, file: !52, line: 1234, baseType: !55, size: 32, offset: 32224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lua_replicate_commands", scope: !141, file: !52, line: 1236, baseType: !55, size: 32, offset: 32256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lua_multi_emitted", scope: !141, file: !52, line: 1237, baseType: !55, size: 32, offset: 32288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lua_repl", scope: !141, file: !52, line: 1238, baseType: !55, size: 32, offset: 32320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lua_timedout", scope: !141, file: !52, line: 1239, baseType: !55, size: 32, offset: 32352)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lua_kill", scope: !141, file: !52, line: 1241, baseType: !55, size: 32, offset: 32384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lua_always_replicate_commands", scope: !141, file: !52, line: 1242, baseType: !55, size: 32, offset: 32416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lazyfree_lazy_eviction", scope: !141, file: !52, line: 1244, baseType: !55, size: 32, offset: 32448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lazyfree_lazy_expire", scope: !141, file: !52, line: 1245, baseType: !55, size: 32, offset: 32480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lazyfree_lazy_server_del", scope: !141, file: !52, line: 1246, baseType: !55, size: 32, offset: 32512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "latency_monitor_threshold", scope: !141, file: !52, line: 1248, baseType: !119, size: 64, offset: 32576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "latency_events", scope: !141, file: !52, line: 1249, baseType: !200, size: 64, offset: 32640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "assert_failed", scope: !141, file: !52, line: 1251, baseType: !798, size: 64, offset: 32704)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "assert_file", scope: !141, file: !52, line: 1252, baseType: !798, size: 64, offset: 32768)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "assert_line", scope: !141, file: !52, line: 1253, baseType: !55, size: 32, offset: 32832)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "bug_report_start", scope: !141, file: !52, line: 1254, baseType: !55, size: 32, offset: 32864)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_period", scope: !141, file: !52, line: 1255, baseType: !55, size: 32, offset: 32896)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "system_memory_size", scope: !141, file: !52, line: 1257, baseType: !129, size: 64, offset: 32960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lruclock_mutex", scope: !141, file: !52, line: 1261, baseType: !806, size: 256, offset: 33024)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !807, line: 72, baseType: !808)
!807 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !807, line: 67, size: 256, elements: !809)
!809 = !{!810, !835, !839}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !808, file: !807, line: 69, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !812, line: 22, size: 256, elements: !813)
!812 = !DIFile(filename: "/usr/include/bits/struct_mutex.h", directory: "")
!813 = !{!814, !815, !816, !817, !818, !819}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !811, file: !812, line: 24, baseType: !55, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !811, file: !812, line: 25, baseType: !7, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !811, file: !812, line: 26, baseType: !55, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !811, file: !812, line: 32, baseType: !55, size: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !811, file: !812, line: 39, baseType: !7, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, scope: !811, file: !812, line: 40, baseType: !820, size: 64, offset: 192)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !811, file: !812, line: 40, size: 64, elements: !821)
!821 = !{!822, !828}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__elision_data", scope: !820, file: !812, line: 48, baseType: !823, size: 32)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !820, file: !812, line: 42, size: 32, elements: !824)
!824 = !{!825, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__espins", scope: !823, file: !812, line: 44, baseType: !826, size: 16)
!826 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__eelision", scope: !823, file: !812, line: 45, baseType: !826, size: 16, offset: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !820, file: !812, line: 49, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_slist_t", file: !830, line: 58, baseType: !831)
!830 = !DIFile(filename: "/usr/include/bits/thread-shared-types.h", directory: "")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_slist", file: !830, line: 55, size: 64, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !831, file: !830, line: 57, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !808, file: !807, line: 70, baseType: !836, size: 192)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 24)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !808, file: !807, line: 71, baseType: !45, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next_client_id_mutex", scope: !141, file: !52, line: 1262, baseType: !806, size: 256, offset: 33280)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "unixtime_mutex", scope: !141, file: !52, line: 1263, baseType: !806, size: 256, offset: 33536)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "nvm_dir", scope: !141, file: !52, line: 1266, baseType: !49, size: 64, offset: 33792)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nvm_base", scope: !141, file: !52, line: 1267, baseType: !49, size: 64, offset: 33856)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nvm_size", scope: !141, file: !52, line: 1268, baseType: !129, size: 64, offset: 33920)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pmem_kind", scope: !141, file: !52, line: 1269, baseType: !846, size: 64, offset: 33984)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "memkind", file: !848, line: 126, flags: DIFlagFwdDecl)
!848 = !DIFile(filename: "../deps/memkind/include/memkind.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sdsmv_threshold", scope: !141, file: !52, line: 1270, baseType: !129, size: 64, offset: 34048)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !852, line: 33, type: !219, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !852, line: 1254, type: !855, isLocal: true, isDefinition: true)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!55, !44, !148, !858}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !217)
!859 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/ljkim/xdp/xdp_redis/src")
!860 = !{i32 7, !"Dwarf Version", i32 4}
!861 = !{i32 2, !"Debug Info Version", i32 3}
!862 = !{i32 1, !"wchar_size", i32 4}
!863 = !{!"clang version 10.0.0-4ubuntu1 "}
!864 = distinct !DISubprogram(name: "xdp_sock_prog", scope: !3, file: !3, line: 28, type: !865, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !875)
!865 = !DISubroutineType(types: !866)
!866 = !{!55, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
